;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! solaire-mode)          ; https://github.com/hlissner/emacs-solaire-modea
(package! info-colors)           ; https://github.com/ubolonton/info-colors
(package! vlf)                   ; https://github.com/m00natic/vlfi
(package! prettier-js)           ; https://github.com/prettier/prettier-emacs
(package! olivetti)              ; https://github.com/rnkn/olivetti
(package! org-ref)               ; https://github.com/jkitchin/org-ref
(package! org-roam-bibtex)       ; https://github.com/org-roam/org-roam-bibtex
(package! org-roam-server)       ; https://github.com/org-roam/org-roam-server
(package! lexic :recipe (:host github :repo "tecosaur/lexic"))
(package! evil-visual-mark-mode) ; https://github.com/roman/evil-visual-mark-mode
(package! racket-mode)           ; https://github.com/greghendershott/racket-mode


;;; debugging/utility packages
;;; only uncomment when I want to use them
;; (package! face-explorer)
;; (package! font-lock-studio)
;; (package! highlight-refontification)
