;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! solaire-mode)             ; https://github.com/hlissner/emacs-solaire-modea
(package! info-colors)              ; https://github.com/ubolonton/info-colors
(package! vlf)                      ; https://github.com/m00natic/vlfi
(package! prettier-js)              ; https://github.com/prettier/prettier-emacs
(package! olivetti)                 ; https://github.com/rnkn/olivetti
(package! org-ref)                  ; https://github.com/jkitchin/org-ref
(package! org-roam-bibtex)          ; https://github.com/org-roam/org-roam-bibtex
(package! org-roam-server)          ; https://github.com/org-roam/org-roam-server
